Why use Klarna
Enjoy secure shopping, lightning-fast checkout, and flexible payment options that suit your budget.
Flexible payments
Pay over time with Klarna's flexible payment options, giving you more control over your budget.⁵
No fees if you pay on time
Shop with confidence knowing there are no surprise fees or charges when you use Klarna.
Smooth checkout
Enjoy a quick, seamless checkout process that makes shopping faster and easier.
Security and buyer protection
Shop safely with Klarna's robust security features and buyer protection, ensuring peace of mind with every transaction.
Cashback & deals
Earn cashback, shop all of your favorite stores and stay on top of your spending.

Hej, we’re Klarna
We’re setting the new standard for how to shop and pay–the smarter, distinctly Swedish way.

Smarter shopping starts here
At Klarna, we're redefining the shopping experience to help people get more out of their money. Here's how:
Pay your way: Choose from interest-free payment plans and customizable payment options.
Earn while you shop: Receive cashback directly in your Klarna balance.¹
Secure shopping: Keep your data safe using advanced encryption and 24/7 fraud monitoring.

Made in Stockholm
Three young Swedish entrepreneurs had a brilliant idea—but not the best name. Kreditor became Klarna in 2010.
Unicorn status unlocked
In 2012, Klarna reached a significant milestone with a $1B+ valuation, recognizing our rapid growth and market impact.
Klarna's family grows
In 2014, Klarna acquired SOFORT, creating Europe’s fastest-growing online payments group.
A bold new era
In 2017, Klarna transformed from blue to bold pink, and secured a full banking license, expanding our capabilities to serve customers.
The Klarna app arrives
Launched in 2018, the Klarna app provides users with tools for smarter shopping, budget management, and seamless payments across online and in-store experiences.
The smart spending leader
As of 2025, Klarna is a leader in digital payments, offering flexible payment options, cashback, and financial tools to millions of shoppers worldwide.

The numbers don't lie
100m Active consumers
720k merchants
2.9m Transactions per day
26 countries supported

Meet the board
The board is Klarna’s top decision-making body, overseeing strategy, operations, and corporate governance to ensure accountability to both the organization and investors.

Get to know our culture
With offices around the world, our global team blends start-up energy with a drive to create bold, impactful change and redefine smarter spending.






About us
Trade Republic is the largest savings platform in Europe enabling millions of people to create wealth.

We are on a mission to empower everyone to create wealth with easy, safe and free access to the financial system.
8M Customers
100B€ Assets
17 Countries

The smartest way to invest, spend and bank.
Earn 2 % interest on unlimited cash with your current account. Get your subscription free card to spend and earn 1 % Saveback. Start investing easily and safely with just 1€.

Earn while you spend
No monthly subscription fee.Unlimited free ATM withdrawals worldwide from 100 €.
Current account with 2 % interest.No fees. Send and receive money easily.
Earn 1 % Savebackon card spending into your Savings Plan.
Round upcard payments and invest spare change on the go.

Save now for later
Start investing with just 1 €in stocks, ETFs or crypto. No hidden fees, easy and safe.
Savings Planson ETFs or stocks to invest continuously for long term wealth.
Open a Child Savings Accountdirectly in the app, in minutes.
Derivatives tradingwith premium partners: HSBC, Société Générale, Vontobel or UBS.

Trusted by millions
Over 8 million users and 100 billion euros of assetsacross 17 European countries.
Authorised by the European Central Bankand supervised by the German Federal Financial Supervisory Authority.
Publicly regulated exchangeand better spreads than the reference market.






bank of The Free
Mobile banking that makes life easy
Sign up in just 5 minutes with only your phone and ID. Try bunq today—your mobile bank on the go.

Finance at your fingertips
All you need from a digital bank, in 1 app
Stay organized with different money pots for budgeting.
Notifications and insights show where your money goes
Grow your savings, with up to 2.01% interest—one of the best rates of interest on savings.
Control everything yourself, day or night—just like you’d expect from a true mobile bank.

Discover bunq today, join 17 million worldwide
Sign up in just 5 minutes

Finally, simple banking that just fits daily life
Forget baffling jargon or waiting for your bank's permission. Discover easy-to-use features that let you manage your money at your own pace.

Tap to tidy up your money
Organize your finances and budget as you like, with dedicated money pots. Create as many as you want! Each has its own IBAN to transfer money, set up direct debits or link to your bunq card.

Cards that simply work
Right when you start, you'll have a Virtual Credit Card that you can use with Apple Pay or Google Pay. For Easy Budgeting, link your card and pay from any of your Bank Accounts. Your Physical Card can have your own design, to make it uniquely yours.

Earn as you spend
Earn 1% Cashback, get the best currency exchange rates with ZeroFX, and rack up bunq Points to unlock exclusive rewards. Just use your bunq card and watch the extra value add up!

The easiest way to invest in Stocks
You don't need to install separate trading apps or go through endless paperwork to get started. Grow your wealth simple and stress-free. Everything you need to get started is in one place—with your truly mobile bank.

Travel worry free
Install an eSIM directly from the bunq app and top it up anytime—even without a connection. Plus, save up to 90% on roaming costs. With bunq Elite, get 8GB of free global data every year and be automatically protected on all your trips with included Travel Insurance.

Effortlessly grow your savings
Enjoy high interest rates, up to 50% higher than you'll get at traditional banks. Your interest is paid out weekly, so with compound interest you'll earn even more interest over time! To reach your savings goals even faster, round up your payments with AutoSave—smarter way to grow your savings.

Save more with bunq Deals
Get discounts from your favorite brands and services—simply by using bunq. Enjoy deals tailored to you, from gadgets to travel bookings.

Choose where we store your deposits
Unlike traditional banks, bunq puts you in control. We're the only bank that lets you decide where your deposits are invested. We invest ethically, and you choose the industries that align with your values in the app. This way, your money supports a more sustainable economy—one that reflects your personal vision for a better future.

Offset your CO2
Spend with your bunq card and earn trees as you go. With veritree, each tree you earn is planted at the right time, in the right place, and carefully tracked as it grows. View the positive impact of your trees over time in the bunq app. It's an easy, transparent way to contribute to a sustainable planet with every purchase.

Trusted by millions of users
Join over 17 million users on the bunq platform







Change the way you money
Home or away, local or global — move freely between countries and currencies. Sign up for free, in a tap.

Your salary, reimagined
Spend smartly, send quickly, sort your salary automatically, and watch your savings grow — all with Revolut.

Join 60+ million customers worldwide and 11+ million in the UK

Elevate your spend
Earn points on every purchase with one of our debit cards. Then redeem them for Airline Miles and more. T&Cs apply.

Go virtual
Create and add virtual cards to Apple or Google Wallet to start paying right away.

Life, meet savings
Grow your money with up to 4.5% AER/Gross (variable) interest rate on savings, paid every day.
AER stands for Annual Equivalent Rate and illustrates what the interest rate would be if interest was paid and compounded once each year. Gross is the interest rate without tax deducted. The interest rate is variable and subject to your selected plan. T&Cs apply.

Your money’s safe space
With Revolut Secure, you’re entering a new era of money security — where our proactive, purpose-built defences and team of fraud specialists help protect every account, 24/7.

Explore 2,500+ stocks
From Apple to Zoom, invest in some of the biggest and most influential companies in the world, commission-free within your monthly allowance.¹
Other fees may apply. Capital at risk.
Discover Commodities
Add more balance to your portfolio with gold, silver, platinum, and palladium. And invest as you spend with automatic round ups.²
Other fees may apply. Capital at risk. Service is not regulated by the FCA.













The bank you’ll love
Bank, save, and invest in one beautifully simple app trusted by millions.

Bank for free — with no hidden fees
Open your account in minutes and enjoy 100% mobile banking. Get a free virtual card and monthly ATM withdrawals.

Get an ECB-linked interest rate
Open a new N26 Metal account and earn 2% interest p.a.* with N26 Instant Savings — linked to the European Central Bank rate.

Truly free stock and ETF trading
Invest in stocks, ETFs, and ready-made funds managed by experts with no fees**. Explore 350+ crypto coins***. Then put it all on autopilot with our flexible investment plans.

Travel without the fees
Make free ATM withdrawals and card payments worldwide. Enjoy market-leading foreign exchange fees. And travel stress-free thanks to insurance included with N26 Go and Metal.

Switch banks in minutes
Open your N26 account and move your recurring payments in just a few taps.

Is N26 a bank?
N26 is the first 100% mobile bank to be granted and operate with a full German banking license from the German Federal Financial Supervisory Authority (BaFin). That means your money is fully protected — both in your bank account and Instant Savings account — up to €100,000 by the German Deposit Protection Scheme. We currently operate in 24 markets worldwide and have over 8 million customers.
